# CannotLoadImperialFamilyToMetricProject Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FamilyFailures..::..CannotLoadImperialFamilyToMetricProject Property
BuiltInFailures..::..FamilyFailures Class See Also
---
Can't load an imperial Family into a metric Project.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotLoadImperialFamilyToMetricProject { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotLoadImperialFamilyToMetricProject As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotLoadImperialFamilyToMetricProject {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..FamilyFailures Class
Autodesk.Revit.DB Namespace